avr-rust/avrd/packs/atmega/AT90USB82.atdf
      <value-group caption="" name="CLK_SEL_3BIT_EXT">
        <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
        <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
        <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
        <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
        <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
        <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
        <value caption="Running, ExtClk Tx Falling Edge" name="VAL_0x06" value="0x06"/>
        <value caption="Running, ExtClk Tx Rising Edge" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
    <module caption="Phase Locked Loop" name="PLL">
      <register-group caption="Phase Locked Loop" name="PLL">
        <register caption="PLL Status and Control register" name="PLLCSR" offset="0x49" size="1">
          <bitfield caption="PLL prescaler Bits" mask="0x1C" name="PLLP" values="PLL_INPUT_PRESCALER"/>
          <bitfield caption="PLL Enable Bit" mask="0x02" name="PLLE"/>
          <bitfield caption="PLL Lock Status Bit" mask="0x01" name="PLOCK"/>
        </register>
      </register-group>
      <value-group caption="" name="PLL_INPUT_PRESCALER">
        <value caption="Clock/4" name="VAL_0x03" value="0x03"/>
        <value caption="Clock/8" name="VAL_0x05" value="0x05"/>
      </value-group>
    </module>
    <module caption="USB Device Registers" name="USB_DEVICE">
      <register-group caption="USB Device Registers" name="USB_DEVICE">
        <register caption="" name="UEINT" offset="0xF4" size="1" mask="0x1F"/>
        <register caption="" name="UEBCLX" offset="0xF2" size="1" mask="0xFF" ocd-rw="R"/>
        <register caption="" name="UEDATX" offset="0xF1" size="1" mask="0xFF" ocd-rw=""/>
        <register caption="" name="UEIENX" offset="0xF0" size="1">
          <bitfield caption="" mask="0x80" name="FLERRE"/>
          <bitfield caption="" mask="0x40" name="NAKINE"/>
          <bitfield caption="" mask="0x10" name="NAKOUTE"/>
          <bitfield caption="" mask="0x08" name="RXSTPE"/>
          <bitfield caption="" mask="0x04" name="RXOUTE"/>
          <bitfield caption="" mask="0x02" name="STALLEDE"/>
          <bitfield caption="" mask="0x01" name="TXINE"/>
        </register>
        <register caption="" name="UESTA1X" offset="0xEF" size="1" ocd-rw="R">
          <bitfield caption="" mask="0x04" name="CTRLDIR"/>
          <bitfield caption="" mask="0x03" name="CURRBK"/>
        </register>
        <register caption="" name="UESTA0X" offset="0xEE" size="1">
          <bitfield caption="" mask="0x80" name="CFGOK"/>
          <bitfield caption="" mask="0x40" name="OVERFI"/>
          <bitfield caption="" mask="0x20" name="UNDERFI"/>
          <bitfield caption="" mask="0x0C" name="DTSEQ"/>
          <bitfield caption="" mask="0x03" name="NBUSYBK"/>
        </register>
        <register caption="" name="UECFG1X" offset="0xED" size="1">
          <bitfield caption="" mask="0x70" name="EPSIZE"/>
          <bitfield caption="" mask="0x0C" name="EPBK"/>
          <bitfield caption="" mask="0x02" name="ALLOC"/>
        </register>
        <register caption="" name="UECFG0X" offset="0xEC" size="1">
          <bitfield caption="" mask="0xC0" name="EPTYPE"/>
          <bitfield caption="" mask="0x01" name="EPDIR"/>
        </register>
        <register caption="" name="UECONX" offset="0xEB" size="1">
          <bitfield caption="" mask="0x20" name="STALLRQ"/>
          <bitfield caption="" mask="0x10" name="STALLRQC"/>
          <bitfield caption="" mask="0x08" name="RSTDT"/>
          <bitfield caption="" mask="0x01" name="EPEN"/>
        </register>
        <register caption="" name="UERST" offset="0xEA" size="1">
          <bitfield caption="" mask="0x1F" name="EPRST"/>
        </register>
        <register caption="" name="UENUM" offset="0xE9" size="1" mask="0x07"/>
        <register caption="" name="UEINTX" offset="0xE8" size="1">
          <bitfield caption="" mask="0x80" name="FIFOCON"/>
          <bitfield caption="" mask="0x40" name="NAKINI"/>
          <bitfield caption="" mask="0x20" name="RWAL"/>
          <bitfield caption="" mask="0x10" name="NAKOUTI"/>
          <bitfield caption="" mask="0x08" name="RXSTPI"/>
          <bitfield caption="" mask="0x04" name="RXOUTI"/>
          <bitfield caption="" mask="0x02" name="STALLEDI"/>
          <bitfield caption="" mask="0x01" name="TXINI"/>
        </register>
        <register caption="" name="UDMFN" offset="0xE6" size="1" ocd-rw="R">
          <bitfield caption="" mask="0x10" name="FNCERR"/>
        </register>
        <register caption="" name="UDFNUM" offset="0xE4" size="2" mask="0x07FF"/>
        <register caption="" name="UDADDR" offset="0xE3" size="1">
          <bitfield caption="" mask="0x80" name="ADDEN"/>
          <bitfield caption="" mask="0x7F" name="UADD"/>
        </register>
        <register caption="" name="UDIEN" offset="0xE2" size="1">
          <bitfield caption="" mask="0x40" name="UPRSME"/>
          <bitfield caption="" mask="0x20" name="EORSME"/>
          <bitfield caption="" mask="0x10" name="WAKEUPE"/>
          <bitfield caption="" mask="0x08" name="EORSTE"/>
          <bitfield caption="" mask="0x04" name="SOFE"/>
          <bitfield caption="" mask="0x01" name="SUSPE"/>
        </register>
        <register caption="" name="UDINT" offset="0xE1" size="1">
          <bitfield caption="" mask="0x40" name="UPRSMI"/>
          <bitfield caption="" mask="0x20" name="EORSMI"/>
          <bitfield caption="" mask="0x10" name="WAKEUPI"/>
          <bitfield caption="" mask="0x08" name="EORSTI"/>
          <bitfield caption="" mask="0x04" name="SOFI"/>
          <bitfield caption="" mask="0x01" name="SUSPI"/>
        </register>
        <register caption="" name="UDCON" offset="0xE0" size="1">
          <bitfield caption="" mask="0x04" name="RSTCPU"/>
          <bitfield caption="" mask="0x02" name="RMWKUP"/>
          <bitfield caption="" mask="0x01" name="DETACH"/>
        </register>
